{"20240108":{"title":"Why I...","links":[],"tags":[],"content":"今年要 28 岁了，一般来说人也到了下坡的时间，日子像雪球一样滚着，没有什么值得额外记录的。心也会孟一层尘隔绝外部的光和热。过去二十多年我也从来没有刻意记录过什么，一直试图把自己放在一种漂浮的状态，无根无基，似乎这种状态才可以避免暴风雨时连根拔起的撕裂。\n但去年确实是很特别的一年，27 岁，对于所有活在梦里的人可能都是一道坎。在豆瓣账号被永久封禁后，那种漂浮感愈发强烈，这种“无重力感”带来的不适慢慢超越了对撕裂的恐惧。过去会不敢面对自己的记录，因为一切都变化的太快，今年的我憎恨着昨天的我，明天的我又会憎恨今天的我。现在仿佛到了一个平原，各种人生的方向也都窥视过一二，自我依旧很令人讨厌，但不至于无法面对。也意识到其他过客无法真的带来什么，只有凝视自己，凝视所带来的未知，才是会扎根的。\n我开始试着去培养一些可以终生的爱好，比如打网球，因为它会用到全身的肌肉以及大脑，比如做游戏，因为它需要文本、编程、图像、音乐所有这些技能。这个年龄开始做这些已经不是想要做出些什么，而是对过去二十多年从来没有真正投入过一件事情的一种亡羊补牢。\n同样工作上今年也会是很关键性的一年，站在一个开创性的机会面前，也站在悬崖绝壁的面前。\n我可能花了二十多年才接纳自己，可以直视自己，从旁观者去看自己的想法，并把这些记录下来。希望这次记录可以延续久一些，此刻虔诚的期望。"},"20240112":{"title":"By the sea","links":["Youtube-Unity-2D-tutorial-(by-Mark-Brown)"],"tags":[],"content":"这两天在看 Unity 2D 的入门材料，一般来说我更习惯读书来学习，但这块的资料好像并没有那么多—— 大部分书籍都是 2016 年左右。这方面我总是有些怪癖，只想通过最近一两年内出版的书来学习。可能是 AI 这个领域日新月异导致的不安全感，总觉得几年前出版的书，大部分内容今天都会失效。\n但实际上 Unity 是一个很稳定的产品 (尽管刚刚裁员 1500) —— 游戏开发周期那么长，如果不向前兼容的话，学习成本太高。这也不由得让人去想，这真的就是最好的设计了么，最初可能只是少数人构思的几个原型，被越来越多的人使用，越做越大，大到没法改版，Hypernormalization. 人本质还是厌恶风险，厌恶改版。\n最初我在看 B 站上的教学视频：https://www.bilibili.com/video/BV1Xj411r7Mm 自称自己是零难度，搜索排名第一的视频。但真的看起来却发现非常痛苦，麦克风收音很差，视频剪辑甚至会跳过关键步骤。而且每一步只是单纯的讲该怎么做，却不讲为什么做。直到看到一条弹幕说“真的讲的好差“，才彻底决定放弃这个教学视频。\n后来我去 Youtube 上找视频，看到 Youtube Unity 2D tutorial (by Mark Brown) 感叹于中英文长视频质量差异之大。但看到后面也让人有一点不适，这种不适很 personal. 主讲人是一个 ginger，很可爱，各种意义上。在视频讲解的间隙，镜头会从屏幕切换到他，他会讲两句俏皮话，配上合适的面部表情。\n问题就在于他看起来很清楚的认识到自己的魅力所在，而且会应用这种魅力。我看过太多的技术人员分享的视频，拘谨，僵硬，心中有千万情绪缺只能用一种尴尬的生态展现。好在大部分时候听众也同样是技术，讲者和听众之间有种不言自明的默契。\n不知道这是不是一种嫉妒？应该是吧。大概有这么几种人，不知道自己身上特质的人，知道自己身上特质但不会（想）去利用的人，知道自己身上特质并主动去利用的人。我可能是第二种，但没有欲望去成为第三种。\n佩服这种做了很精致剪辑（一定反复反复录了很多遍，注意每一个细节），同时还展示自己的脆弱和尴尬的视频。这说明他一定已经很接纳自己了，能够真诚的把自己交付给这个世界。\n这种人能有什么问题呢？后来我查到这个人叫 Mark Brown，做高质量游戏解读视频非常有名。我在网上搜他的评论，会有很多人抱怨他讲的东西很浅显但故作高深，但也有人说他其实不会不懂装懂，很坦诚自己没有那么专业。唯独没有人不喜欢他的视频风格，大家都很喜欢他的声音，停顿，节奏。\n我想我不喜欢的原因还是，某种深处，我们可能会是一种人，内向，敏感，带着一点点小聪明。区别就在于，我还在用这些去构建自我防御，而他却能把这些转化成风格去生产。难道痛苦就只配在地下室一个人慢慢咀嚼么？在镜头前剪辑了三十遍的脆弱，会给人带来一丝坚强么？\n写到这里慢慢有点写不下去了，这些议题缠绕在我身上太久，像阴魂一样。像三岛由纪夫所说，这些对生产力确实没有帮助，我想过去我就是陷入这些太久了，想要保持情绪的一种纯粹性而不加控制。实际上并不矛盾，就像大海，在海中，还是在海岸，海还会是海。我需要多站在海岸上一些。"},"20240119":{"title":"On Daniel Mullins","links":[],"tags":[],"content":"Daniel Mullins 一直以来我都很欣赏。从最早的 Pony Island 开始，那时 meta game 才刚兴起，Pony Island 也被归到其中一员，我玩了很多当时的 meta game，除了 Beginners’s guide 这种刻骨铭心的游戏之外，最喜欢的，或者说最印象深刻的游戏应该就是 Pony Island. \n!\n一般的 meta game 只是单纯的戏谑，但他的游戏像是要把游戏这个概念打碎，有点如同 porn 看得太多，最终走向那种极端。他的游戏总带着一种psychology horror，这种 horror 如今在游戏里已经家常便饭，但他的特殊点在于，完全不依赖恐怖游戏这一载体，没有 jump scare, 令人恐怖的点来自于游戏的虚拟性，游戏这个载体本身已经足够恐怖。这种恐怖与真探 / Ligotti 的恐怖有某种共通点，是来自系统的恐怖，这种恐怖与玩家的所作所为没有关系，玩家只是恐怖的见证者。\n\n他会称自己的游戏为 AR 游戏，经常利用玩家的文件系统。比如威胁玩家删除电脑里最大的文件，伪装 steam 好友发消息，把谜底存在游戏本地的 txt 文件。在我看来其中的每一项都算是神来之笔，但对他却是足够信手拈来。这不由得让我好奇他是个怎么样的人，什么样的人才有足够的恶意去营造这样的恐怖，什么样的人才有癫狂的大脑去构建这样的创意。\n结果向那些伊藤润二的崇拜者见到本人一样，一种合乎常理的失落。他本人看起来极其朴素，走在大街上不会有任何人把他和这些游戏关联起来。我想 John Carpenter / 佐杜洛夫斯基那种是人们脑海中期望的艺术家，他们的黑暗带着美学，人们期望这种美学能够反射到他们的仪态和穿搭。\n\n而 Daniel mullins 看起来只有那无法忽视的秃顶和木讷，以及，他看起来，真的很像一个假人。而且比他的实际年龄大很多。有些游戏开发者有着天然的”性张力”，比如 Toby Fox，比如 Phil Fish，比如 Lucas Pope。这应该也是他并没有那么作为”作者”层面火爆的原因——尽管他的作品非常有作者性。\n后面我看到了他的一些早年采访：\n\nhttps://www.gamesindustry.biz/from-failed-a-kickstarter-to-career-defining-success\nhttps://wethenerdy.com/lets-catch-monstersan-interview-with-daniel-mullins/\n\n也是非常之正常。但还是有很多值得借鉴的点：\n成为独立游戏开发者，最重要的能力，在我看来，就是快速 prototype 的能力。几乎所有优秀的开发者都有这个能力，任何一个想法和游戏机制，都有一套自己熟悉的工具箱 (代码 / 美术) 可以快速搭建出 demo。而这种东西大都是要通过 Game Jam 去锻炼。\n想到前一段看到的日本动画屎山理论：https://nga.178.com/read.php?tid=38474269&amp;rand=34, 大概意思是日本动画之所以有很多佳作，原因是他们站在大量粪作上面。其实历史上看起来的璀璨时期，大部分充斥于市场上的还是粪作。做游戏应该也是类似，我需要做很多足够烂的 demo，无聊甚至破碎的 demo，才会逐渐明白自己想要的到底是什么。游戏这个行业相比于别的创作行业 (音乐 / 图书 / 电影)，对 demo 的容忍度和接受度是最高的，只要你一直在做，就会有反馈和群体。唯一重要的就是要一直做，一直完成。\n关于我想要游戏做成什么样，现在没什么思路，即使有将来也大概会被推翻，我能想到的关键词有：\n\nDub / Trip hop\nBlack Humor\nDiscomforting\n"},"20240124":{"title":"Balance","links":["Essential-Tennis"],"tags":[],"content":"上周五 trip 的一个很大感想是，如今生活中的诸多痛苦，都是因为缺乏平衡导致的。这里的平衡可以分成两个方面：\n\n\n身体层面\nEssential Tennis\n\n左手 / 右手\n左腿 / 右腿\n左眼 / 右眼\n\n\n\n性格层面\n健康的 MBTI 应当是均衡的而不是偏科的，可以理解成类似于网球中的正反手，足球中的左右脚。比如对应的数值模型是反手 80 分正手 60 分，我们会叫一名运动员“反手球员“ 。\n而 MBTI 的问题就在于，即使反手 80 分正手 79 分，我们还是会叫他“反手球员”。当然我们可以饮用比值的概念，比如 70% 反手 30% 正手，但你依旧无法据此判断他是 70 分反手 30 分正手，还是 7 分反手 3 分正手。\n回到 MBTI 上：\n\nI / E. 这个可以定义成从哪种模式可以汲取到快乐，或者说是舒适。实际上 sx / sp / so 的模型可能会更合适一点。“真正”健康的人应该是既能享受多人，也能享受亲密关系，也能享受独处。 而我目前明显并不能享受人多的状态。\nN / S.\n\n\n"}}